# Data Analysis with Pandas: Problems 02

This assignment focuses on integrating and analyzing data from multiple sources. You will use advanced Pandas techniques like merging DataFrames, handling missing data, and performing detailed time-series analysis to solve a new set of business problems. Two datasets have been provided for this assignment.

## The Use Case: Multi-Source Data Analysis

The business owner, Ms. Kavita, now has two separate datasets: sales_data.csv (containing daily order details) and customer_info.csv (containing customer names and their city of residence). She needs to combine these datasets to gain deeper insights into her customer base and product sales. Your task is to use Pandas to link these two data sources and answer her questions.

## Instructions

For each problem, write and execute the Python code using Pandas. The problems are designed to be solved sequentially. Load both datasets and use them as needed.

### Problem 1: Data Loading and Merging

Your first task is to load both CSV files and merge them into a single DataFrame. This combined dataset will be the foundation for all subsequent analysis.

Write Python code to:

* Load sales_data.csv into a DataFrame named df_sales.
* Load customer_info.csv into a DataFrame named df_customers.
* Merge the two DataFrames on a common column. Choose the correct join type to ensure no sales records are lost.
* Display the first 5 rows and the column information of the new, merged DataFrame.

Hint: Look for a common identifier column in both datasets to perform the join.

In [34]:
import os
os.getcwd()

'C:\\Users\\home\\Desktop\\FSD\\Assignments\\24_16_Aug_2025_Data_Analysis_with_Pandas_assignment_02'

In [56]:
import pandas as pd
#Load sales_data.csv into a DataFrame named df_sales
df_sales=pd.read_csv("sales_data.csv")
#Load customer_info.csv into a DataFrame named df_customers
df_customers=pd.read_csv("customer_info.csv")
#Merge the two DataFrames on a common column.
merged_df=pd.merge(df_sales,df_customers,on='customer_id',how='inner')
merged_df=merged_df.sort_values(by='customer_id',ascending=True)
# Display the first 5 rows
print(merged_df.head())
# Display information of new,merged DataFrame
print(merged_df.info())

    order_id  customer_id product_id      product_name  quantity  \
1        102            1    PROD002     Vanilla Dream         4
15       116            1    PROD003     Vanilla Dream         3
29       130            1    PROD005  Strawberry Swirl         1
23       124            1    PROD003      Mango Medley         2
28       129            1    PROD002    Chocolate Chip         1

    unit_price_inr  order_date  total_price_inr customer_name    city  \
1            242.0  2025-07-02              968         Aarav  Mumbai
15           136.0  2025-07-16              408         Aarav  Mumbai
29            98.0  2025-07-30               98         Aarav  Mumbai
23           104.0  2025-07-24              208         Aarav  Mumbai
28            80.0  2025-07-29               80         Aarav  Mumbai

                     email
1   customer_1@example.com
15  customer_1@example.com
29  customer_1@example.com
23  customer_1@example.com
28  customer_1@example.com
<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 1 to 78
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         100 non-null    int64
 1   customer_id      100 non-null    int64
 2   product_id       100 non-null    object
 3   product_name     100 non-null    object
 4   quantity         100 non-null    int64
 5   unit_price_inr   95 non-null     float64
 6   order_date       100 non-null    object
 7   total_price_inr  100 non-null    int64
 8   customer_name    100 non-null    object
 9   city             100 non-null    object
 10  email            93 non-null     object
dtypes: float64(1), int64(4), object(6)
memory usage: 9.4+ KB
None

### Problem 2: Advanced Analytical Questions with Merged Data

Now that you have the combined dataset, answer Ms. Kavita's more complex questions that require customer and sales information together.

Write Python code to:

* Find the total sales revenue generated from customers in each city.
* Identify the top 3 best-selling products by quantity.
* Determine the city with the highest total revenue.
* Find the customer who has spent the most money in total.

In [17]:
# The total sales revenue genrated from customers in each city
total_sales_revenue=merged_df.groupby(['city'])['total_price_inr'].sum().reset_index().sort_values(by='total_price_inr',ascending=False)
total_sales_revenue

        city  total_price_inr
1      Delhi            16284
3     Mumbai             9891
2  Hyderabad             8313
0  Bangalore             5608

In [18]:
#Identify the top 3 best-selling products by quantity.
top_products=merged_df.groupby('product_name')['quantity'].sum().reset_index().sort_values(by='quantity',ascending=False)
print('Top 3 products by quantity')
top_products.head(3)

Top 3 products by quantity

       product_name  quantity
4     Vanilla Dream        56
3  Strawberry Swirl        48
0    Chocolate Chip        45

In [19]:
#Determine the city with the highest total revenue.
highest_total_revenue=merged_df.groupby('city')['total_price_inr'].sum()
highest_total_revenue.max()

16284

In [20]:
#Find the customer who has spent the most money in total
customer_expenditure=merged_df.groupby('customer_name')['total_price_inr'].sum().reset_index().sort_values(by='total_price_inr',ascending=False)
top_customer=customer_expenditure.iloc[0]
print(f"Customer who spend the most:{top_customer['customer_name']}={top_customer['total_price_inr']}")

Customer who spend the most:Suresh=7074

### Problem 3: Cleaning and Filtering for Specific Insights

Ms. Kavita needs to prepare a report for her marketing team. This requires some data cleaning and specific filtering.

Write Python code to:

* Identify and handle any missing values in the merged DataFrame. Explain your chosen method.
* Filter the DataFrame to show all orders made by customers from 'Mumbai' for the 'Pistachio Delight' product.
* Create a new DataFrame containing only the columns: customer_name, city, product_name, and total_price_inr for all orders that have a revenue of more than INR 300.

In [21]:
# Check no of missing values before handling
print("Missing values before handling")
print(merged_df.isnull().sum())
#Fill the missing values using fillna()
print("Handling missing values")
merged_df['unit_price_inr']=merged_df['unit_price_inr'].fillna(0)
merged_df=merged_df.fillna({'email':'unknown'})
# Check the dataframe after filling the missing values
print("Missing values after handling")
print(merged_df.isnull().sum())

Missing values before handling
order_id           0
customer_id        0
product_id         0
product_name       0
quantity           0
unit_price_inr     5
order_date         0
total_price_inr    0
customer_name      0
city               0
email              7
dtype: int64
Handling missing values
Missing values after handling
order_id           0
customer_id        0
product_id         0
product_name       0
quantity           0
unit_price_inr     0
order_date         0
total_price_inr    0
customer_name      0
city               0
email              0
dtype: int64

In [22]:
#Filter the DataFrame to show all orders made by customers from 'Mumbai' for the 'Pistachio Delight' product.
orders_df=merged_df[(merged_df['city']=='Mumbai')&(merged_df['product_name']=='Pistachio Delight')]
print("Orders made by customers from 'Mumbai' for the 'Pistachio Delight' product:")
orders_df

Orders made by customers from 'Mumbai' for the 'Pistachio Delight' product:

,order_id,customer_id,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr,customer_name,city,email
0,101,14,PROD005,Pistachio Delight,3,126.0,2025-07-01,378,Pranav,Mumbai,customer_14@example.com
73,174,14,PROD003,Pistachio Delight,2,115.0,2025-09-12,230,Pranav,Mumbai,customer_14@example.com
91,192,14,PROD001,Pistachio Delight,1,112.0,2025-09-30,112,Pranav,Mumbai,customer_14@example.com

In [23]:
#Create a new DataFrame containing only the columns: customer_name, city, product_name, and total_price_inr and revenue>300
new_customers_df=merged_df[merged_df['total_price_inr']>300][['customer_name','city','product_name','total_price_inr']]
print('Data frame with high revenue')
new_customers_df.head()

Data frame with high revenue

  customer_name       city       product_name  total_price_inr
0        Pranav     Mumbai  Pistachio Delight              378
1         Aarav     Mumbai      Vanilla Dream              968
2        Suresh      Delhi  Pistachio Delight              856
3          Siya  Hyderabad     Chocolate Chip              748
4         Deepa     Mumbai      Vanilla Dream              310

### Problem 4: Time-Series and Product-Specific Analysis

The business wants to understand how sales of specific products trend over time and how they perform on different days.

Write Python code to:

* Convert the 'order_date' column to a proper datetime format.
* Create a new column named 'day_of_week' that shows the day name (e.g., 'Monday', 'Tuesday').
* Calculate the total revenue for the 'Vanilla Dream' product each day.
* Find the average daily revenue for each product.

In [24]:
#Convert the 'order_date' column to a proper datetime format
merged_df['order_date']=pd.to_datetime(merged_df['order_date'])
print("The order_date column to a proper datetime format")
print(merged_df.head())

The order_date column to a proper datetime format
   order_id  customer_id product_id       product_name  quantity  \
0       101           14    PROD005  Pistachio Delight         3
1       102            1    PROD002      Vanilla Dream         4
2       103            9    PROD002  Pistachio Delight         4
3       104            2    PROD003     Chocolate Chip         4
4       105           10    PROD001      Vanilla Dream         2

   unit_price_inr order_date  total_price_inr customer_name       city  \
0           126.0 2025-07-01              378        Pranav     Mumbai
1           242.0 2025-07-02              968         Aarav     Mumbai
2           214.0 2025-07-03              856        Suresh      Delhi
3           187.0 2025-07-04              748          Siya  Hyderabad
4           155.0 2025-07-05              310         Deepa     Mumbai

                     email
0  customer_14@example.com
1   customer_1@example.com
2   customer_9@example.com
3   customer_2@example.com
4  customer_10@example.com

In [25]:
#Create a new column named 'day_of_week' that shows the day name (e.g., 'Monday', 'Tuesday')
merged_df['day_of_week']=merged_df['order_date'].dt.day_name()
print(merged_df[['order_date','day_of_week']])
merged_df.head()

   order_date day_of_week
0  2025-07-01     Tuesday
1  2025-07-02   Wednesday
2  2025-07-03    Thursday
3  2025-07-04      Friday
4  2025-07-05    Saturday
..        ...         ...
95 2025-10-04    Saturday
96 2025-10-05      Sunday
97 2025-10-06      Monday
98 2025-10-07     Tuesday
99 2025-10-08   Wednesday

[100 rows x 2 columns]

,order_id,customer_id,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr,customer_name,city,email,day_of_week
0,101,14,PROD005,Pistachio Delight,3,126.0,2025-07-01,378,Pranav,Mumbai,customer_14@example.com,Tuesday
1,102,1,PROD002,Vanilla Dream,4,242.0,2025-07-02,968,Aarav,Mumbai,customer_1@example.com,Wednesday
2,103,9,PROD002,Pistachio Delight,4,214.0,2025-07-03,856,Suresh,Delhi,customer_9@example.com,Thursday
3,104,2,PROD003,Chocolate Chip,4,187.0,2025-07-04,748,Siya,Hyderabad,customer_2@example.com,Friday
4,105,10,PROD001,Vanilla Dream,2,155.0,2025-07-05,310,Deepa,Mumbai,customer_10@example.com,Saturday

In [26]:
#Calculate the total revenue for the 'Vanilla Dream' product each day
total_revenue=merged_df[merged_df['product_name']=='Vanilla Dream'].groupby(['order_date','product_name','day_of_week'])['total_price_inr'].sum().reset_index()
print("Total revenue for the Vanilla Dream  product each day")
print(total_revenue.head())

Total revenue for the Vanilla Dream  product each day
  order_date   product_name day_of_week  total_price_inr
0 2025-07-02  Vanilla Dream   Wednesday              968
1 2025-07-05  Vanilla Dream    Saturday              310
2 2025-07-13  Vanilla Dream      Sunday              732
3 2025-07-14  Vanilla Dream      Monday              456
4 2025-07-15  Vanilla Dream     Tuesday              148

In [32]:
#Find the average daily revenue for each product.
daily_revenue=merged_df.groupby(['order_date','product_name'])['total_price_inr'].sum().reset_index()
avg_daily_revenue=daily_revenue.groupby(['order_date','product_name'])['total_price_inr'].mean().reset_index()
print('Average daily revenue for each product')
avg_daily_revenue

Average daily revenue for each product

   order_date       product_name  total_price_inr
0  2025-07-01  Pistachio Delight            378.0
1  2025-07-02      Vanilla Dream            968.0
2  2025-07-03  Pistachio Delight            856.0
3  2025-07-04     Chocolate Chip            748.0
4  2025-07-05      Vanilla Dream            310.0
..        ...                ...              ...
95 2025-10-04       Mango Medley            248.0
96 2025-10-05       Mango Medley            488.0
97 2025-10-06       Mango Medley            884.0
98 2025-10-07   Strawberry Swirl            486.0
99 2025-10-08      Vanilla Dream            291.0

[100 rows x 3 columns]